arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_web_interface.cpp
#include "HardwareSerial.h"
#include <ArduinoJson.h>
#include <TimeLib.h>
#include <new>
#include "esp_netif.h"

#include "ESP32_treadmill_tacho_web.h"
#include "ESP32_treadmill_tacho_config.h"
#include "ESP32_treadmill_tacho_workout.h"
#include "ESP32_treadmill_tacho_bootlog.h"
#include "web_monitor/web_monitor_main_ts.h"
#include "web_settings/web_settings_main_ts.h"
#include "web_workout/web_workout_main_ts.h"
#include "ESP32_treadmill_tacho_ui_assets.h"

extern WorkoutExecutor gWorkout;
// extern SpeedFilter bandFilter;  // OLD SYSTEM REMOVED
// extern SpeedFilter motorFilter; // OLD SYSTEM REMOVED

// ============================================================================
// Web Server Initialization and Route Definitions
// Business logic is organized into modular folders:
//  - src/web_monitor/: Monitor page API and visualization
//    - web_api_monitor.cpp: Monitor value getters (getSpeed, getPace, etc.)
//    - web_chart_builders.cpp: HR/RR chart JSON generation
//    - web_validation.cpp: Settings validation logic
//    - web_template.cpp: HTML template variable substitution
//  - src/web_workout/: Workout page components
//    - web_workout_input.cpp: File upload section
//    - web_workout_control.cpp: Control buttons section
//    - web_workout_view.cpp: Visualization section
//    - web_workout_test.cpp: Manual test controls section
//    - web_workout_common.cpp: Shared utilities
//    - web_workout_main.cpp: Page assembly
// ============================================================================

void initWebServer() {
  DefaultHeaders::Instance().addHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
  DefaultHeaders::Instance().addHeader("Pragma", "no-cache");
  DefaultHeaders::Instance().addHeader("Expires", "0");
  DefaultHeaders::Instance().addHeader("Keep-Alive", "timeout=2, max=10");

  // Split UI pages
  Ui::Main::addRoutes(server);
  Ui::Settings::addRoutes(server);
  Ui::Workout::addRoutes(server);
  Ui::Assets::addRoutes(server);

  // ===== API: Combined monitor endpoint (single request for all values) =====
  server.on("/api/monitor", HTTP_GET, [](AsyncWebServerRequest *r){
    // Build JSON with all monitor values in one response
    String json = "{";
    json += "\"speed\":\"" + getSpeed() + "\",";
    json += "\"pacemin\":\"" + getPaceMin() + "\",";
    json += "\"pacesec\":\"" + getPaceSec() + "\",";
    json += "\"distance\":\"" + getDistance() + "\",";
    json += "\"distanceunit\":\"" + getDistanceUnit() + "\",";
    json += "\"hour\":\"" + getHour() + "\",";
    json += "\"minute\":\"" + getMinute() + "\",";
    json += "\"second\":\"" + getSecond() + "\",";
    json += "\"offset\":\"" + getOffset() + "\",";
    json += "\"rpm\":\"" + getRPM() + "\",";
    json += "\"motorrpm\":\"" + getMotorRPM() + "\",";
    json += "\"heartrate\":\"" + getHeartRate() + "\",";
    json += "\"rr\":\"" + getRR() + "\",";
    json += "\"datetime\":\"" + getDateTime() + "\",";
    json += "\"testdata\":" + String(testdata ? "true" : "false") + ",";
    json += "\"signalquality\":\"" + getSignalQuality() + "\",";
    json += "\"signalcv\":\"" + getSignalCV() + "\",";
    json += "\"signalfreq\":\"" + getSignalFrequency() + "\",";
    json += "\"signalclass\":\"" + getSignalQualityClass() + "\"";
    json += "}";
    r->send(200, "application/json", json);
  });

  // ===== API: Individual endpoints (legacy, still useful) =====
  server.on("/api/speed",      HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getSpeed()); });
  server.on("/api/pacesec",    HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getPaceSec()); });
  server.on("/api/pacemin",    HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getPaceMin()); });
  server.on("/api/motorrpm",   HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getMotorRPM()); });
  server.on("/api/distance",   HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getDistance()); });
  server.on("/api/distanceunit",HTTP_GET,[](AsyncWebServerRequest *r){ r->send(200,"text/plain", getDistanceUnit()); });
  server.on("/api/rpm",        HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getRPM()); });
  server.on("/api/hour",       HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getHour()); });
  server.on("/api/minute",     HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getMinute()); });
  server.on("/api/second",     HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getSecond()); });
  server.on("/api/offset",     HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getOffset()); });
  server.on("/api/heartrate",  HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getHeartRate()); });
  server.on("/api/rr",         HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getRR()); });
  server.on("/api/hr-series",  HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"application/json", buildHeartRateSeriesJson()); });
  server.on("/api/rr-series",  HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"application/json", buildRRSeriesJson()); });
  server.on("/api/datetime",   HTTP_GET, [](AsyncWebServerRequest *r){ r->send(200,"text/plain", getDateTime()); });
  
  // ===== Boot Log API =====
  server.on("/api/bootlog", HTTP_GET, [](AsyncWebServerRequest *r){
    String log = readBootLog();
    r->send(200, "text/plain", log);
  });

  // ===== Buttons (monitor page) =====
  server.on("/offset/up", HTTP_GET, [](AsyncWebServerRequest *req) {
    metrics.mpsOffset += 0.139f;
    req->redirect("/");
  });
  server.on("/offset/down", HTTP_GET, [](AsyncWebServerRequest *req) {
    metrics.mpsOffset = metrics.mpsOffset >= 0.139f ? (metrics.mpsOffset - 0.139f) : 0.0f;
    req->redirect("/");
  });
  server.on("/reset", HTTP_GET, [](AsyncWebServerRequest *req) {
    resetWorkout();
    Serial.println("Workout reset via web interface");
    req->redirect("/");
  });
  server.on("/testdata", HTTP_GET, [](AsyncWebServerRequest *req) {
    enableTestdata(!testdata);
    req->redirect("/");
  });

  // ===== Manual Test Controls (Workout Page) =====
  server.on("/api/test/speed/up", HTTP_POST, [](AsyncWebServerRequest *req) {
    writePress(storedGlobals.SPEED_UP_PIN, true);
    req->send(200, "text/plain", "OK");
  });
  server.on("/api/test/speed/down", HTTP_POST, [](AsyncWebServerRequest *req) {
    writePress(storedGlobals.SPEED_DOWN_PIN, true);
    req->send(200, "text/plain", "OK");
  });
  server.on("/api/test/incline/up", HTTP_POST, [](AsyncWebServerRequest *req) {
    writePress(storedGlobals.INCLINE_UP_PIN, true);
    req->send(200, "text/plain", "OK");
  });
  server.on("/api/test/incline/down", HTTP_POST, [](AsyncWebServerRequest *req) {
    writePress(storedGlobals.INCLINE_DOWN_PIN, true);
    req->send(200, "text/plain", "OK");
  });

  // ===== Settings API =====
  server.on("/api/settings", HTTP_POST,
    // finalize
    [](AsyncWebServerRequest *request) {
      String* acc = static_cast<String*>(request->_tempObject);
      request->_tempObject = nullptr;

      if (!acc || acc->isEmpty()) {
        if (acc) delete acc;
        request->send(400, "application/json", "{\"success\":false,\"message\":\"Empty body\"}");
        return;
      }

      String& jsonString = *acc;
      String wifiSSID         = extractJsonValue(jsonString, "wifiSSID");
      String wifiPassword     = extractJsonValue(jsonString, "wifiPassword");
      String bleDeviceName    = extractJsonValue(jsonString, "bleDeviceName");

      int    interruptPin     = extractJsonValue(jsonString, "interruptPin").toInt();
      int    motorInterruptPin= extractJsonValue(jsonString, "motorInterruptPin").toInt();
      int    speedUpPin       = extractJsonValue(jsonString, "speedUpPin").toInt();
      int    speedDownPin     = extractJsonValue(jsonString, "speedDownPin").toInt();
      int    inclineUpPin     = extractJsonValue(jsonString, "inclineUpPin").toInt();
      int    inclineDownPin   = extractJsonValue(jsonString, "inclineDownPin").toInt();

      uint32_t testdataFreq   = extractJsonValue(jsonString, "testdataFreq").toInt();

