arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_web_interface.cpp
      long   beltDistance     = extractJsonValue(jsonString, "beltDistance").toInt();
      long   debounceThreshold= extractJsonValue(jsonString, "debounceThreshold").toInt();
      long   maxRevolutionTime= extractJsonValue(jsonString, "maxRevolutionTime").toInt();
      long   pulsesPerRev     = extractJsonValue(jsonString, "pulsesPerRev").toInt();
      long   bandPulseMult    = extractJsonValue(jsonString, "bandPulseMultiplier").toInt();
      long   motorPulsesPerRev= extractJsonValue(jsonString, "motorPulsesPerRev").toInt();
      long   motorPulseMult   = extractJsonValue(jsonString, "motorPulseMultiplier").toInt();
      float  motorToBeltRatio = extractJsonValue(jsonString, "motorToBeltRatio").toFloat();

      int    sensorSourceMode = extractJsonValue(jsonString, "sensorSourceMode").toInt();
      int    bandFilterType   = extractJsonValue(jsonString, "bandFilterType").toInt();
      int    motorFilterType  = extractJsonValue(jsonString, "motorFilterType").toInt();

      uint32_t inertiaDelay   = extractJsonValue(jsonString, "inertiaDelay").toInt();

      // PIDAJ controller parameters
      float  pidKp            = extractJsonValue(jsonString, "pidKp").toFloat();
      float  pidKi            = extractJsonValue(jsonString, "pidKi").toFloat();
      float  pidKa            = extractJsonValue(jsonString, "pidKa").toFloat();
      float  pidKj            = extractJsonValue(jsonString, "pidKj").toFloat();
      float  pidDeadZone      = extractJsonValue(jsonString, "pidDeadZone").toFloat();
      float  pidLPThresh      = extractJsonValue(jsonString, "pidLongPressThresh").toFloat();
      float  pidIClamp        = extractJsonValue(jsonString, "pidIClamp").toFloat();
      uint32_t pidPulseCooldown = extractJsonValue(jsonString, "pidPulseCooldown").toInt();
      uint32_t pidLPMax       = extractJsonValue(jsonString, "pidLongPressMax").toInt();
      float  pidCoastTh       = extractJsonValue(jsonString, "pidCoastThreshold").toFloat();

      if (!validateSettings(wifiSSID, wifiPassword, bleDeviceName, interruptPin, motorInterruptPin,
                            speedUpPin, speedDownPin, inclineUpPin, inclineDownPin,
                            testdataFreq, beltDistance, debounceThreshold,
                            maxRevolutionTime, pulsesPerRev, motorPulsesPerRev, motorToBeltRatio)) {
        delete acc;
        request->send(200, "application/json", "{\"success\":false,\"message\":\"Invalid settings\"}");
        return;
      }

      storedGlobals.WIFI_SSID     = wifiSSID;
      if (wifiPassword.length() > 0) storedGlobals.WIFI_PASSWORD = wifiPassword;
      storedGlobals.BLE_DEVICE_NAME          = bleDeviceName;
      storedGlobals.INTERRUPT_PIN            = interruptPin;
      storedGlobals.MOTOR_INTERRUPT_PIN      = motorInterruptPin;
      storedGlobals.SPEED_UP_PIN             = speedUpPin;
      storedGlobals.SPEED_DOWN_PIN           = speedDownPin;
      storedGlobals.INCLINE_UP_PIN           = inclineUpPin;
      storedGlobals.INCLINE_DOWN_PIN         = inclineDownPin;
      storedGlobals.TESTDATA_FREQ_MS         = testdataFreq;
      storedGlobals.BELT_DISTANCE_MM         = beltDistance;
      // Clamp debounce to hardware limits (1-13 µs)
      if (debounceThreshold < 1) debounceThreshold = 1;
      if (debounceThreshold > 13) debounceThreshold = 13;
      storedGlobals.DEBOUNCE_THRESHOLD_US    = debounceThreshold;
      storedGlobals.MAX_REVOLUTION_TIME_MS   = maxRevolutionTime;
      storedGlobals.PULSES_PER_REV           = pulsesPerRev;
      // Clamp pulse multipliers (1-100)
      bandPulseMult  = (bandPulseMult < 1 || bandPulseMult > 100) ? 1 : bandPulseMult;
      motorPulseMult = (motorPulseMult < 1 || motorPulseMult > 100) ? 1 : motorPulseMult;
      storedGlobals.BAND_PULSE_MULTIPLIER    = bandPulseMult;
      storedGlobals.MOTOR_PULSES_PER_REV     = motorPulsesPerRev;
      storedGlobals.MOTOR_PULSE_MULTIPLIER   = motorPulseMult;
      storedGlobals.MOTOR_TO_BELT_RATIO      = motorToBeltRatio;
      sensorSourceMode = (sensorSourceMode < 0 || sensorSourceMode > 2) ? 0 : sensorSourceMode;
      
      // Check if sensor source mode changed - if so, reset filters
      bool sensorModeChanged = (storedGlobals.SENSOR_SOURCE_MODE != (uint8_t)sensorSourceMode);
      
      storedGlobals.SENSOR_SOURCE_MODE       = (uint8_t)sensorSourceMode;
      
      // Clamp filter types to valid range (0-3)
      bandFilterType  = (bandFilterType < 0 || bandFilterType > 3) ? 1 : bandFilterType;
      motorFilterType = (motorFilterType < 0 || motorFilterType > 3) ? 1 : motorFilterType;
      
      storedGlobals.BAND_FILTER_TYPE  = (uint8_t)bandFilterType;
      storedGlobals.MOTOR_FILTER_TYPE = (uint8_t)motorFilterType;
      
      if (inertiaDelay >= 100 && inertiaDelay <= 10000)
        storedGlobals.INERTIA_DELAY_MS = inertiaDelay;

      // PIDAJ controller parameters with validation
      if (pidKp >= 0.1f && pidKp <= 10.0f)
        storedGlobals.PID_Kp = pidKp;
      if (pidKi >= 0.0f && pidKi <= 2.0f)
        storedGlobals.PID_Ki = pidKi;
      if (pidKa >= 0.0f && pidKa <= 10.0f)
        storedGlobals.PID_Ka = pidKa;
      if (pidKj >= 0.0f && pidKj <= 5.0f)
        storedGlobals.PID_Kj = pidKj;
      if (pidDeadZone >= 0.05f && pidDeadZone <= 1.0f)
        storedGlobals.PID_DEAD_ZONE = pidDeadZone;
      if (pidLPThresh >= 0.3f && pidLPThresh <= 5.0f)
        storedGlobals.PID_LONG_PRESS_THRESH = pidLPThresh;
      if (pidIClamp >= 0.5f && pidIClamp <= 20.0f)
        storedGlobals.PID_I_CLAMP = pidIClamp;
      if (pidPulseCooldown >= 100 && pidPulseCooldown <= 2000)
        storedGlobals.PID_PULSE_COOLDOWN_MS = pidPulseCooldown;
      if (pidLPMax >= 3000 && pidLPMax <= 30000)
        storedGlobals.PID_LONG_PRESS_MAX_MS = pidLPMax;
      if (pidCoastTh >= 0.01f && pidCoastTh <= 0.2f)
        storedGlobals.PID_COAST_THRESHOLD = pidCoastTh;

      // Update filter settings immediately
      // OLD SYSTEM REMOVED: Filter configuration no longer used
      // bandFilter.setFilterType((SpeedFilterType)bandFilterType);
      // motorFilter.setFilterType((SpeedFilterType)motorFilterType);
      
      // Reset filters when switching sensor source to prevent stale data
      if (sensorModeChanged) {
        // OLD SYSTEM REMOVED: Filter reset no longer needed
        // bandFilter.reset();
        // motorFilter.reset();
        Serial.printf("[SENSOR] Mode changed (filters removed in NEW system)\r\n");
      }

