arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_web_interface.cpp
      String details = saveSettings();
      delete acc;

      if (details.isEmpty()) {
        request->send(200, "application/json", "{\"success\":true,\"message\":\"Settings saved successfully\"}");
      } else {
        request->send(200, "application/json", "{\"success\":false,\"message\":\"" + details + "\"}");
      }
      Serial.println("Settings updated via web interface");
    },
    // onUpload (unused)
    nullptr,
    // onBody: accumulate JSON
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      String* acc = static_cast<String*>(request->_tempObject);
      if (index == 0) {
        acc = new String();
        if (acc && total > 0 && total < 64*1024) acc->reserve(total);
        request->_tempObject = acc;
      }
      if (acc && len) acc->concat((const char*)data, len);
    }
  );

  server.on("/api/settings/defaults", HTTP_POST, [](AsyncWebServerRequest *req){
    loadDefaultSettings(); saveSettings();
    req->send(200,"application/json","{\"success\":true,\"message\":\"Default settings loaded\"}");
    Serial.println("Default settings loaded via web interface");
  });

  server.on("/api/factory-reset", HTTP_POST, [](AsyncWebServerRequest *req){
    factoryReset(); loadDefaultSettings();
    req->send(200,"application/json","{\"success\":true,\"message\":\"Factory reset complete\"}");
    Serial.println("Factory reset performed via web interface");
    delay(1000); ESP.restart();
  });

  server.on("/api/reboot", HTTP_POST, [](AsyncWebServerRequest *req){
    req->send(200,"application/json","{\"success\":true,\"message\":\"Rebooting device\"}");
    Serial.println("Reboot requested via web interface");
    delay(1000); ESP.restart();
  });

  // ===== Calibration API =====
  server.on("/api/calibrate/start", HTTP_POST, [](AsyncWebServerRequest *req){
    startSpeedCalibration();
    req->send(200,"application/json","{\"success\":true,\"message\":\"Calibration started\"}");
  });

  server.on("/api/calibrate/status", HTTP_GET, [](AsyncWebServerRequest *req){
    String status = getCalibrationStatus();
    req->send(200,"application/json", status);
  });

  // ===== Workout: state =====
  server.on("/api/workout/state", HTTP_GET, [](AsyncWebServerRequest* r){
    JsonDocument doc;
    WorkoutProgress pr = gWorkout.getProgress();
    const char* st =
      pr.state == WorkoutState::Idle     ? "Idle" :
      pr.state == WorkoutState::Running  ? "Running" :
      pr.state == WorkoutState::Paused   ? "Paused" :
      pr.state == WorkoutState::Finished ? "Finished" : "Error";

    doc["state"]            = st;
    doc["total_s"]          = pr.total_s;
    doc["elapsed_s"]        = pr.elapsed_s;
    doc["step_index"]       = pr.step_index;
    doc["step_elapsed_s"]   = pr.step_elapsed_s;
    doc["step_remaining_s"] = pr.step_remaining_s;
    doc["speed_kph"]        = pr.current_speed_kph * gWorkout.getSpeedScale();
    doc["incline_pct"]      = pr.current_incline_pct;
    doc["label"]            = pr.current_label;
    if (pr.error.length())  doc["error"] = pr.error;

    // Only include the full workout structure if explicitly requested
    if (r->hasParam("full") && r->getParam("full")->value() == "1") {
      JsonArray steps = doc["steps"].to<JsonArray>();
      for (const auto& s : gWorkout.steps()) {
        JsonObject o = steps.add<JsonObject>();
        o["d"] = s.duration_s;
        o["v"] = s.speed_kph * gWorkout.getSpeedScale();
        o["i"] = s.incline_pct;
        o["l"] = s.label;
      }
    }
    String out; serializeJson(doc, out);
    r->send(200, "application/json", out);
  });

  // ===== Workout: control =====
  server.on("/api/workout/control", HTTP_POST, [](AsyncWebServerRequest* req){
    if (!req->hasParam("action", true)) { req->send(400, "text/plain", "Missing action"); return; }
    String action = req->getParam("action", true)->value();
    if      (action == "start")  gWorkout.start();
    else if (action == "pause")  gWorkout.pause();
    else if (action == "resume") gWorkout.resume();
    else if (action == "stop")   gWorkout.stop();
    else { req->send(400, "text/plain", "Unknown action"); return; }
    req->send(200, "text/plain", "OK");
  });

  // ===== Workout: upload (.zwo) =====
  server.on("/api/workout/upload", HTTP_POST,
    // finalize
    [](AsyncWebServerRequest* request){
      Serial.println("[UPLOAD] finalize");
      String* acc = static_cast<String*>(request->_tempObject);
      request->_tempObject = nullptr;
      if (!acc || acc->length() == 0) {
        Serial.printf("[UPLOAD] empty body (contentLength=%d)\r\r\n", (int)request->contentLength());
        if (acc) delete acc;
        request->send(400, "text/plain", "Missing or empty body");
        return;
      }
      Serial.printf("[UPLOAD] received %u bytes\r\r\n", (unsigned)acc->length());
      bool ok = gWorkout.loadFromZwoString(*acc);
      delete acc;
      if (!ok) {
        auto p = gWorkout.getProgress();
        Serial.printf("[UPLOAD] parse error: %s\r\r\n", p.error.c_str());
        request->send(400, "text/plain", "ZWO parse error: " + p.error);
      } else {
        Serial.println("[UPLOAD] OK");
        request->send(200, "text/plain", "OK");
      }
    },
    // multipart chunks
    [](AsyncWebServerRequest* request, const String& filename, size_t index,
       uint8_t* data, size_t len, bool final)
    {
      if (index == 0) {
        Serial.printf("[UPLOAD] begin file='%s' total=%d\r\n", filename.c_str(), (int)request->contentLength());
        String* acc = new String();
        if (acc && request->contentLength() > 0 && request->contentLength() < 512*1024)
          acc->reserve(request->contentLength());
        request->_tempObject = acc;
      }
      String* acc = static_cast<String*>(request->_tempObject);
      if (acc && len) acc->concat((const char*)data, len);
      Serial.printf("[UPLOAD] chunk idx=%u len=%u acc=%u final=%d\r\n",
                    (unsigned)index, (unsigned)len, acc ? (unsigned)acc->length() : 0, final ? 1 : 0);
    },
    // onBody (unused; multipart goes to onUpload)
    nullptr
  );

