arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_web_interface.cpp
  // ===== Workout: pace scaling (global) =====
  server.on("/api/workout/scale", HTTP_GET, [](AsyncWebServerRequest* r){
    String out = String(gWorkout.getSpeedScale(), 4);
    r->send(200, "text/plain", out);
  });

  server.on("/api/workout/scale/nudge", HTTP_POST, [](AsyncWebServerRequest* req){
    if (!req->hasParam("rel", true)) { req->send(400, "text/plain", "Missing rel"); return; }
    float rel = req->getParam("rel", true)->value().toFloat();
    float factor = 1.0f + rel;
    if (factor <= 0.0f) { req->send(400, "text/plain", "Bad factor"); return; }
    gWorkout.scaleAllSpeeds(factor);
    // Keep threshold in sync: threshold is s/km (inverse of speed), so divide by factor
    float curThr = gWorkout.getThreshold();
    if (curThr > 0.0f) gWorkout.setThreshold(curThr / factor);
    req->send(200, "text/plain", "OK");
  });

  // Threshold: GET returns current s/km; POST val=<s/km> rescales steps and stores new threshold
  server.on("/api/workout/threshold", HTTP_GET, [](AsyncWebServerRequest* r){
    r->send(200, "text/plain", String(gWorkout.getThreshold(), 1));
  });

  server.on("/api/workout/threshold", HTTP_POST, [](AsyncWebServerRequest* req){
    if (!req->hasParam("val", true)) { req->send(400, "text/plain", "Missing val"); return; }
    float newThr = req->getParam("val", true)->value().toFloat();
    if (newThr <= 0.0f || newThr > 3600.0f) { req->send(400, "text/plain", "Bad value"); return; }
    float oldThr = gWorkout.getThreshold();
    if (oldThr > 0.0f && fabsf(newThr - oldThr) > 0.01f) {
      gWorkout.scaleAllSpeeds(oldThr / newThr); // rescale steps proportionally
    }
    gWorkout.setThreshold(newThr);
    req->send(200, "text/plain", "OK");
  });

  server.on("/api/workout/upload", HTTP_OPTIONS, [](AsyncWebServerRequest* r){ r->send(204); });

  // Favicon handler - simple 16x16 pixel gear icon
  server.on("/favicon.ico", HTTP_GET, [](AsyncWebServerRequest* r){
    const uint8_t favicon_ico[] = {
      0x00, 0x00, 0x01, 0x00, 0x01, 0x00, 0x10, 0x10, 0x10, 0x00, 0x01, 0x00, 0x04, 0x00, 0x28, 0x01,
      0x00, 0x00, 0x16, 0x00, 0x00, 0x00, 0x28, 0x00, 0x00, 0x00, 0x10, 0x00, 0x00, 0x00, 0x20, 0x00,
      0x00, 0x00, 0x01, 0x00, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x80, 0x80, 0x80, 0x00, 0xC0, 0xC0, 0xC0, 0x00, 0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x11, 0x11, 0x00, 0x01, 0x22, 0x21, 0x10,
      0x12, 0x22, 0x22, 0x21, 0x12, 0x11, 0x11, 0x21, 0x21, 0x11, 0x11, 0x12, 0x21, 0x22, 0x22, 0x12,
      0x12, 0x22, 0x22, 0x21, 0x01, 0x22, 0x22, 0x10, 0x00, 0x12, 0x21, 0x00, 0x00, 0x01, 0x10, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF
    };
    AsyncWebServerResponse* response = r->beginResponse(200, "image/x-icon", favicon_ico, sizeof(favicon_ico));
    response->addHeader("Cache-Control", "public, max-age=31536000");
    r->send(response);
  });

  server.onNotFound([](AsyncWebServerRequest* r){
    Serial.printf("[404] %s %s\r\n", r->methodToString(), r->url().c_str());
    r->send(404);
  });

  ElegantOTA.begin(&server);
  ElegantOTA.setAuth("admin", "admin");
  server.begin();

  // Print server URLs
  if (wifi.apMode) {
    Serial.println("Web server: http://192.168.4.1");
    Serial.println("Settings page: http://192.168.4.1/settings");
  } else if (wifi.connected) {
    esp_netif_ip_info_t ip_info;
    esp_netif_t* netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (netif && esp_netif_get_ip_info(netif, &ip_info) == ESP_OK) {
      Serial.printf("Web server: http://" IPSTR "\r\n", IP2STR(&ip_info.ip));
      Serial.printf("Settings page: http://" IPSTR "/settings\r\n", IP2STR(&ip_info.ip));
    }
  } else {
    Serial.println("Web server started (no IP yet)");
  }
  testdata = false;
}
